papers/onlinewatermarking.html
---
layout: page
title: An Online Approach to Physical Watermark Design
---
<hr>

<p>
<b>Hanxiao Liu, Yilin Mo, Jiaqi Yan, Lihua Xie and Karl H. Johansson</b>
</p>

<p>
<i>IEEE Trans. on Automatic Control</i>, Submitted
</p>

<p>
Link to the <a href="../../../public/papers/tac18watermark.pdf">paper</a>
</p>

<p>
If you want to leave any comments, you can annotate the <a href="../../../pdfviewer/viewer/web/viewer.html?file=%2Fpublic%2Fpapers%2Ftac18watermark.pdf">pdf</a>. I will try to be responsive. You can also annotate this page or leave comments below. 
</p>

<div id="outline-container-orgd4f4f83" class="outline-2">
<h2 id="orgd4f4f83">Abstract</h2>
<div class="outline-text-2" id="text-orgd4f4f83">
<p>
This paper considers the problem of designing physical watermark signals in order to optimally detect possible replay attack in a linear time-invariant system, under the assumption that the system parameters are unknown and need to be identified online. We first provide a replay attack model, where an adversary replays the previous sensor data in order to fool the system. A physical watermarking scheme, which leverages a random control input as a watermark to detect the replay attack, is then introduced. The optimal watermark signal design problem is cast as an optimization problem, which aims to achieve the optimal trade-off between control performance and intrusion detection. An online watermarking design and system identification algorithm is provided to deal with systems with unknown parameters. We prove that the proposed algorithm converges to the optimal one and characterize the almost sure convergence rate. A numerical example and an industrial process example are provided to illustrate the effectiveness of the proposed strategy.
</p>
</div>
</div>
